
#### Terraform Plan
<details>
<summary>Expand</summary>

```
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/shared-infrastructure/runs/run-kmrP3VQ6815qCaYW

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
module.global_certificate["jackievink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b52c04e4-2275-4af0-b511-2b7856ae0c2a]
module.global_certificate["timovink.me"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/7f64e0e2-6db5-4238-84c2-f6e6cb4d3784]
module.global_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b5424589-49e4-41be-aed5-4e0387f5e995]
module.global_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/ed6e0edc-3d1a-41fd-900a-9342fcb09642]
module.global_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c14c4e0f-400b-415b-bdf9-f5b38995b474]
module.global_certificate["jackievink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/87bd463a-2474-40d3-814b-0446977549de]
module.global_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c37f96fe-c8d6-4cfa-a752-9b95610577d1]
module.iam.aws_iam_group.administrators: Refreshing state... [id=administrators]
module.dns["timovink.ca"].aws_route53_zone.this: Refreshing state... [id=Z08658091IB2VPYFZRTIS]
module.iam.aws_iam_user.admin["deployer"]: Refreshing state... [id=deployer]
module.iam.aws_iam_user.admin["tvink"]: Refreshing state... [id=tvink]
module.dns["timovink.app"].aws_route53_zone.this: Refreshing state... [id=Z090672659X2JIXVUFX0]
module.dns["timovink.dev"].aws_route53_zone.this: Refreshing state... [id=Z09071302Y5GD83DY6NXW]
module.dns["timovink.me"].aws_route53_zone.this: Refreshing state... [id=Z03760682G96A69XLHYRC]
module.dns["jackievink.com"].aws_route53_zone.this: Refreshing state... [id=Z0213673ODBY64GY09TO]
module.dns["timovink.com"].aws_route53_zone.this: Refreshing state... [id=ZFMCDCUJ8UCFO]
module.dns["jackievink.ca"].aws_route53_zone.this: Refreshing state... [id=Z072293219D14M35KH4SZ]
module.domain_redirects["timovink.dev"].aws_cloudfront_function.redirect: Refreshing state... [id=tv-sharedinfra-redirecttotimovinkdev]
module.domain_redirects["jackievink.com"].aws_cloudfront_function.redirect: Refreshing state... [id=tv-sharedinfra-redirecttojackievinkcom]
module.local_certificate["jackievink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/4b69412d-6c17-451c-bc83-3718bff09b26]
module.local_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/9cf0da07-dfd0-4ffd-bc97-1d53a1c498cb]
module.local_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/a5f9fd0b-1fac-49d1-beba-b87ce4550483]
module.local_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/1d5e180f-aceb-44e7-93ff-d116ec4132dc]
module.local_certificate["timovink.me"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/9e0afce7-ba56-4bce-85d4-822ed158b26d]
module.local_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/bf00816d-2214-47e9-9533-e82bf38b838e]
module.local_certificate["jackievink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/9b4e1e44-c855-46e9-94a1-6e98e725b685]
module.budget.aws_budgets_budget.monthly: Refreshing state... [id=920122847127:terraform-20220612005833117900000001]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=administrators-20220605021751233100000001]
module.iam.aws_iam_user_group_membership.admin["tvink"]: Refreshing state... [id=terraform-20220605021751235700000002]
module.iam.aws_iam_user_group_membership.admin["deployer"]: Refreshing state... [id=terraform-20220604232226591200000002]
module.global_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.global_certificate["timovink.me"].aws_route53_record.validation["timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.global_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.global_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.me"].aws_route53_record.validation["*.timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.me"].aws_route53_record.validation["*.timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.local_certificate["timovink.me"].aws_route53_record.validation["timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC__d981f155ba389684d19abaf617b78217.timovink.me._CNAME]
module.local_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"]: Refreshing state... [id=Z0213673ODBY64GY09TO__456a894c8fe28e49ad6211de6dc5bc82.jackievink.com._CNAME]
module.local_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ__937652936d27f2d693c725eb2355f79f.jackievink.ca._CNAME]
module.global_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:25.278 +0000 UTC]
module.global_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.me"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["jackievink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["jackievink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:26.207 +0000 UTC]
module.local_certificate["timovink.me"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["jackievink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["jackievink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.ca"]: Refreshing state... [id=E3PHIQXJMETTPU]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.app"]: Refreshing state... [id=EAY5X8SBN5IQF]
module.domain_redirects["jackievink.com"].aws_cloudfront_distribution.this["jackievink.ca"]: Refreshing state... [id=EWZR221LI6SAB]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.com"]: Refreshing state... [id=E2D3O6B3HCBCCK]
module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.me"]: Refreshing state... [id=E2GZRPVZ7VHNJP]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.me"]: Refreshing state... [id=Z03760682G96A69XLHYRC_timovink.me_A]
module.domain_redirects["jackievink.com"].aws_route53_record.this["jackievink.ca"]: Refreshing state... [id=Z072293219D14M35KH4SZ_jackievink.ca_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0_timovink.app_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS_timovink.ca_A]
module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO_timovink.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain_redirects["jackievink.com"].aws_cloudfront_distribution.this["jackievink.ca"] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "EWZR221LI6SAB"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttojackievinkcom" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.domain_redirects["jackievink.com"].aws_cloudfront_function.redirect must be replaced
-/+ resource "aws_cloudfront_function" "redirect" {
      ~ arn             = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttojackievinkcom" -> (known after apply)
      ~ etag            = "ETVPDKIKX0DER" -> (known after apply)
      ~ id              = "tv-sharedinfra-redirecttojackievinkcom" -> (known after apply)
      ~ live_stage_etag = "ETVPDKIKX0DER" -> (known after apply)
      ~ name            = "tv-sharedinfra-redirecttojackievinkcom" -> "redirect-to-jackievinkcom" # forces replacement
      ~ status          = "DEPLOYED" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.app"] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "EAY5X8SBN5IQF"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttotimovinkdev" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.ca"] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E3PHIQXJMETTPU"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttotimovinkdev" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.com"] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E2D3O6B3HCBCCK"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttotimovinkdev" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.me"] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E2GZRPVZ7VHNJP"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttotimovinkdev" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_function.redirect must be replaced
-/+ resource "aws_cloudfront_function" "redirect" {
      ~ arn             = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttotimovinkdev" -> (known after apply)
      ~ etag            = "ETVPDKIKX0DER" -> (known after apply)
      ~ id              = "tv-sharedinfra-redirecttotimovinkdev" -> (known after apply)
      ~ live_stage_etag = "ETVPDKIKX0DER" -> (known after apply)
      ~ name            = "tv-sharedinfra-redirecttotimovinkdev" -> "redirect-to-timovinkdev" # forces replacement
      ~ status          = "DEPLOYED" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.
```

</details>